In [1]:
import pandas as pd
import sys
import os
import sqlite3

DB_PATH = os.path.expanduser("/Users/ultrenzv/Documents/DEV/waiswallet/app/data/waiswallet.db")

conn = sqlite3.connect(DB_PATH, check_same_thread=False)
cursor = conn.cursor()

In [2]:
query = """
SELECT c.label, SUM(td.line_amount) AS total_spent 
FROM transaction_details td JOIN transaction_headers th ON td.header_id = th.id 
JOIN categories c ON td.category_id = c.id 
WHERE strftime('%Y-%m', td.billing_date) = strftime('%Y-%m', 'now') 
GROUP BY c.label ORDER BY total_spent DESC LIMIT 3;
"""
    
df = pd.read_sql_query(query, conn)

if df.empty:
    print("ℹ️ Connection successful, but the 'wallets' table is currently empty.")
else:
    display(df)

               label  total_spent
0  Bills & Utilities       6200.0
1   Groceries & Mart       3500.0
2           Shopping       1250.0

In [8]:
query = """
SELECT *
FROM wallets
"""
    
df = pd.read_sql_query(query, conn)

if df.empty:
    print("ℹ️ Connection successful, but the 'wallets' table is currently empty.")
else:
    display(df)

,id,name,provider,type,balance,available_credit,credit_limit,cycle_day,due_day,monthly_cashback_limit,cashback_ytd,version,created_at,updated_at
0,1,Amore Cashback,BPI,credit,4750.0,45250.0,50000.0,26.0,15.0,1000.0,152.50,3,2026-02-02 18:20:12,2026-02-02 18:20:12
1,2,EastWest Visa,EastWest,credit,73399.0,26601.0,100000.0,5.0,25.0,1500.0,69.95,4,2026-02-02 18:20:12,2026-02-02 18:20:12
2,3,Main Savings,BDO,debit,91550.0,85000.0,NaN,NaN,NaN,0.0,0.00,3,2026-02-02 18:20:12,2026-02-02 18:20:12

In [9]:
query = """
SELECT 
    c.label AS Category,
    COALESCE(SUM(td.line_amount), 0) AS Total_Spent,
    COALESCE(mb.amount, 0) AS Monthly_Budget,
    COALESCE(mb.amount, 0) - COALESCE(SUM(td.line_amount), 0) AS Remaining_Budget
FROM categories c
LEFT JOIN transaction_details td ON c.id = td.category_id
LEFT JOIN monthly_budgets mb ON c.id = mb.category_id AND mb.month_year = strftime('%Y-%m', 'now')
GROUP BY c.id, c.label, mb.amount
ORDER BY Total_Spent DESC;
"""
    
df = pd.read_sql_query(query, conn)

if df.empty:
    print("ℹ️ Connection successful, but the 'wallets' table is currently empty.")
else:
    display(df)

               Category  Total_Spent  Monthly_Budget  Remaining_Budget
0              Shopping      13250.0         10000.0           -3250.0
1     Bills & Utilities       6200.0         12000.0            5800.0
2      Groceries & Mart       3500.0         15000.0           11500.0
3  Restaurants & Dining        850.0          8000.0            7150.0
4          Digital Subs        549.0          1500.0             951.0
5        Transportation        350.0          5000.0            4650.0

In [ ]:
query = """
SELECT * FROM wallets
"""
    
df = pd.read_sql_query(query, conn)

if df.empty:
    print("ℹ️ Connection successful, but the 'wallets' table is currently empty.")
else:
    display(df)